[Killed] BlockStatement
Desktop/LabFinal/src/1-BMI.js:1:47
-function calculateBMI(heightInCM, weightInKG) {
-  if (heightInCM === '' || heightInCM < 0 || isNaN(heightInCM)) {
-    return 'Please provide a valid height'
-  } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
-    return 'Please provide a valid weight'
-  } else {
-    return (weightInKG / ((heightInCM * heightInCM) / 10000)).toFixed(2)
-  }
-}
+function calculateBMI(heightInCM, weightInKG) {}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "18.52"
Received: undefined

[Killed] EqualityOperator
Desktop/LabFinal/src/1-BMI.js:2:28
 function calculateBMI(heightInCM, weightInKG) {
-  if (heightInCM === '' || heightInCM < 0 || isNaN(heightInCM)) {
+  if (heightInCM === '' || heightInCM <= 0 || isNaN(heightInCM)) {
     return 'Please provide a valid height'
   } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NaN"
Received: "Please provide a valid height"

[Killed] ConditionalExpression
Desktop/LabFinal/src/1-BMI.js:2:7
 function calculateBMI(heightInCM, weightInKG) {
-  if (heightInCM === '' || heightInCM < 0 || isNaN(heightInCM)) {
+  if (false) {
     return 'Please provide a valid height'
   } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid height"
Received: "140.63"

[Killed] LogicalOperator
Desktop/LabFinal/src/1-BMI.js:4:14
 function calculateBMI(heightInCM, weightInKG) {
   if (heightInCM === '' || heightInCM < 0 || isNaN(heightInCM)) {
     return 'Please provide a valid height'
-  } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
+  } else if ((weightInKG === '' || weightInKG < 0) && isNaN(weightInKG)) {
     return 'Please provide a valid weight'
   } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Please provide a valid weight"
Received: "-140.63"

[Killed] ConditionalExpression
Desktop/LabFinal/src/1-BMI.js:4:14
 function calculateBMI(heightInCM, weightInKG) {
   if (heightInCM === '' || heightInCM < 0 || isNaN(heightInCM)) {
     return 'Please provide a valid height'
-  } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
+  } else if (true) {
     return 'Please provide a valid weight'
   } else {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "18.52"
Received: "Please provide a valid weight"

[Killed] BlockStatement
Desktop/LabFinal/src/1-BMI.js:6:10
     return 'Please provide a valid height'
   } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
     return 'Please provide a valid weight'
-  } else {
-    return (weightInKG / ((heightInCM * heightInCM) / 10000)).toFixed(2)
-  }
+  } else {}
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "18.52"
Received: undefined

[Killed] ArithmeticOperator
Desktop/LabFinal/src/1-BMI.js:7:13
   } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
     return 'Please provide a valid weight'
   } else {
-    return (weightInKG / ((heightInCM * heightInCM) / 10000)).toFixed(2)
+    return (weightInKG * (heightInCM * heightInCM / 10000)).toFixed(2)
   }
 }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "18.52"
Received: "194.40"

[Killed] ArithmeticOperator
Desktop/LabFinal/src/1-BMI.js:7:28
   } else if (weightInKG === '' || weightInKG < 0 || isNaN(weightInKG)) {
     return 'Please provide a valid weight'
   } else {
-    return (weightInKG / ((heightInCM * heightInCM) / 10000)).toFixed(2)
+    return (weightInKG / ((heightInCM / heightInCM) / 10000)).toFixed(2)
   }
 }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "18.52"
Received: "600000.00"
