[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:1:49
-function temperatureConverter(measurement, val) {
-  var result1, result2
-
-  if (measurement == 'F') {
-    result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
-    result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'C') {
-    result1 = (val * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'K') {
-    result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val - 273.15).toFixed(2) + ' C'
-  } else {
-    return 'wrong input'
-  }
-  return [result1, result2]
-}
+function temperatureConverter(measurement, val) {}
 module.exports = {
   temperatureConverter,
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.00 C", "273.15 K"]
Received: undefined

[Killed] EqualityOperator
Desktop/LabFinal/src/2-converter.js:4:7
 function temperatureConverter(measurement, val) {
   var result1, result2
 
-  if (measurement == 'F') {
+  if (measurement != 'F') {
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["0.00 C", "273.15 K"]
Received: "wrong input"

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:4:27
 function temperatureConverter(measurement, val) {
   var result1, result2
 
-  if (measurement == 'F') {
-    result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
-    result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'C') {
+  if (measurement == 'F') {} else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "0.00 C",
-   "273.15 K",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:5:16
   var result1, result2
 
   if (measurement == 'F') {
-    result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
+    result1 = ((val - 32) * 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "18.89 C",
+   "61.20 C",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:5:17
   var result1, result2
 
   if (measurement == 'F') {
-    result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
+    result1 = ((val + 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "0.00 C",
+   "35.56 C",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:6:16
 
   if (measurement == 'F') {
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
-    result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
+    result2 = ((val - 32) / 1.8 - 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "0.00 C",
-   "273.15 K",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:6:16
 
   if (measurement == 'F') {
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
-    result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
+    result2 = ((val - 32) * 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "18.89 C",
-   "292.04 K",

[Killed] EqualityOperator
Desktop/LabFinal/src/2-converter.js:7:14
   if (measurement == 'F') {
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'C') {
+  } else if (measurement !== 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["89.60 F", "305.15 K"]
Received: "wrong input"

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:7:14
   if (measurement == 'F') {
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'C') {
+  } else if (false) {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["89.60 F", "305.15 K"]
Received: "wrong input"

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:8:16
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
-    result1 = (val * 1.8 + 32).toFixed(2) + ' F'
+    result1 = (val / 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "89.60 F",
+   "49.78 F",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:8:16
     result1 = ((val - 32) / 1.8).toFixed(2) + ' C'
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
-    result1 = (val * 1.8 + 32).toFixed(2) + ' F'
+    result1 = (val * 1.8 - 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "89.60 F",
+   "25.60 F",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:9:16
     result2 = ((val - 32) / 1.8 + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val + 273.15).toFixed(2) + ' K'
+    result2 = (val - 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
     result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "89.60 F",
-   "305.15 K",

[Killed] ConditionalExpression
Desktop/LabFinal/src/2-converter.js:10:14
   } else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'K') {
+  } else if (false) {
     result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val - 273.15).toFixed(2) + ' C'
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["-402.07 F", "-241.15 C"]
Received: "wrong input"

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:10:35
   } else if (measurement === 'C') {
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
-  } else if (measurement === 'K') {
-    result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val - 273.15).toFixed(2) + ' C'
-  } else {
+  } else if (measurement === 'K') {} else {
     return 'wrong input'
   }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "-402.07 F",
-   "-241.15 C",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:11:16
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
-    result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
+    result1 = ((val - 273.15) * 1.8 - 32).toFixed(2) + ' F'
     result2 = (val - 273.15).toFixed(2) + ' C'
   } else {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "-402.07 F",
+   "-466.07 F",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:11:16
     result1 = (val * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
-    result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
+    result1 = ((val - 273.15) / 1.8 + 32).toFixed(2) + ' F'
     result2 = (val - 273.15).toFixed(2) + ' C'
   } else {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "-402.07 F",
+   "-101.97 F",

[Killed] ArithmeticOperator
Desktop/LabFinal/src/2-converter.js:12:16
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
     result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val - 273.15).toFixed(2) + ' C'
+    result2 = (val + 273.15).toFixed(2) + ' C'
   } else {
     return 'wrong input'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "-402.07 F",
-   "-241.15 C",

[Killed] StringLiteral
Desktop/LabFinal/src/2-converter.js:12:43
     result2 = (val + 273.15).toFixed(2) + ' K'
   } else if (measurement === 'K') {
     result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
-    result2 = (val - 273.15).toFixed(2) + ' C'
+    result2 = (val - 273.15).toFixed(2) + ""
   } else {
     return 'wrong input'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "-402.07 F",
-   "-241.15 C",

[Killed] BlockStatement
Desktop/LabFinal/src/2-converter.js:13:10
   } else if (measurement === 'K') {
     result1 = ((val - 273.15) * 1.8 + 32).toFixed(2) + ' F'
     result2 = (val - 273.15).toFixed(2) + ' C'
-  } else {
-    return 'wrong input'
-  }
+  } else {}
   return [result1, result2]
 }
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "wrong input"
Received: [undefined, undefined]
