[Killed] BlockStatement
Desktop/LabFinal/src/3-sorting.js:1:29
-function selectionSort(arr) {
-  let n = arr.length
-
-  for (let i = 0; i < n; i++) {
-    let min = i
-    for (let j = i + 1; j < n; j++) {
-      if (arr[j] < arr[min]) {
-        min = j
-      }
-    }
-
-    if (min != i) {
-      let tmp = arr[i]
-      arr[i] = arr[min]
-      arr[min] = tmp
-    }
-  }
-  return arr
-}
+function selectionSort(arr) {}
 module.exports = {
   selectionSort,
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3, 4]
Received: undefined

[Killed] BlockStatement
Desktop/LabFinal/src/3-sorting.js:6:37
 
   for (let i = 0; i < n; i++) {
     let min = i
-    for (let j = i + 1; j < n; j++) {
-      if (arr[j] < arr[min]) {
-        min = j
-      }
-    }
+    for (let j = i + 1; j < n; j++) {}
 
     if (min != i) {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:6:25
 
   for (let i = 0; i < n; i++) {
     let min = i
-    for (let j = i + 1; j < n; j++) {
+    for (let j = i + 1; false; j++) {
       if (arr[j] < arr[min]) {
         min = j
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] EqualityOperator
Desktop/LabFinal/src/3-sorting.js:7:11
   for (let i = 0; i < n; i++) {
     let min = i
     for (let j = i + 1; j < n; j++) {
-      if (arr[j] < arr[min]) {
+      if (arr[j] >= arr[min]) {
         min = j
       }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   2,

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:7:11
   for (let i = 0; i < n; i++) {
     let min = i
     for (let j = i + 1; j < n; j++) {
-      if (arr[j] < arr[min]) {
+      if (false) {
         min = j
       }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ConditionalExpression
Desktop/LabFinal/src/3-sorting.js:12:9
       }
     }
 
-    if (min != i) {
+    if (false) {
       let tmp = arr[i]
       arr[i] = arr[min]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] EqualityOperator
Desktop/LabFinal/src/3-sorting.js:12:9
       }
     }
 
-    if (min != i) {
+    if (min == i) {
       let tmp = arr[i]
       arr[i] = arr[min]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,
